fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>BKM_ЕжемесячнаяАбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BKM_СтоимостьЧасаРаботыСпециалиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_КатегорияСотрудников</name>
    <type>
      <types>EnumRef.ВКМ_КатегорииСотрудников</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

fonecmid-diplom/src/CommonModules/ВКМ_РаботаСФормамиКлиентСервер/Module.bsl
#Область ПрограммныйИнтерфейс    

// Процедура "ДополнитьФорму"
//
// Описание:
//   Данная процедура предназначена для дополнения пользовательского интерфейса формы.
//   Она используется для добавления новых элементов управления, настройки их свойств
//   и размещения на форме.
//
// Параметры:
//   Форма - Форма
//     Ссылка на форму, которую необходимо дополнить.
//
// Пример использования:
//   ДополнитьФорму(ЭтаФорма);
Процедура ВКМ_ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ВКМ_ФормаЭлемента" Тогда
		ДобавитьПоляПериодДействияАбонентскуюПлатуИПочасовуюОплату(Форма);  
	КонецЕсли;
	
	Если ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКнопкуЗаполнить(Форма);
	КонецЕсли;
	
	Если ИмяФормы = "Справочник.Пользователи.Форма.ФормаЭлемента" Тогда
		ДобавитьПолеПодразделение(Форма);  
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции  

Процедура ДобавитьПолеПодразделение(Форма)
	
	ГруппаДанныеШапки = Форма.Элементы.Найти("ГруппаДанныеШапки");
	ПолеВвода = Форма.Элементы.Добавить("ВКМ_КатегорияСотрудников", Тип("ПолеФормы"), ГруппаДанныеШапки);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.Видимость = Истина;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_КатегорияСотрудников";

КонецПроцедуры


Процедура ДобавитьПоляПериодДействияАбонентскуюПлатуИПочасовуюОплату(Форма)	
	
	ПолеВвода = Форма.Элементы.Добавить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.Видимость = Ложь;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
	ПолеВвода = Форма.Элементы.Добавить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.Видимость = Ложь;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
	ПолеВвода = Форма.Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.Видимость = Ложь;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	ПолеВвода = Форма.Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.Видимость = Ложь;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";	
	
КонецПроцедуры


Процедура ДобавитьКнопкуЗаполнить(Форма);     
	
    НоваяКоманда = Форма.Команды.Добавить("ВКМ_Заполнить");                  
    НоваяКоманда.Действие = "ВКМ_ВызватьАвтозаполнение";
    НоваяКоманда.Заголовок = "Заполнить по данным Заявок"; 
	
    НоваяКнопка = Форма.Элементы.Добавить("ВКМ_Кнопка_Заполнить", Тип("КнопкаФормы"), Форма.Элементы.ФормаКоманднаяПанель);
    НоваяКнопка.ИмяКоманды = "ВКМ_Заполнить";  
    НоваяКнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка; 	
	
КонецПроцедуры


#КонецОбласти
